{
  "header": {
    "title": "Arsip Karya",
    "meta": "Dokumentasi — 2026"
  },
  "interface": {
    "projectIndexPrefix": "Proyek",
    "conceptLabel": "Konsep",
    "actions": {
      "release": "Releases",
      "source": "Repositori"
    }
  },
  "projects": [
    {
      "id": "chronicle-log",
      "title": "Chronicle Log",
      "subtitle": "Brankas pengetahuan berbasis akses taksonomi memori",
      "concept": "Pendekatan radikal terhadap privasi digital yang menghilangkan navigasi visual konvensional. Chronicle Log menggunakan gerbang 'Memory-Locked' di mana data tetap tersembunyi hingga dipanggil melalui kunci kategori yang spesifik. Sistem ini dirancang sebagai ruang pribadi di mana keamanan informasi bergantung sepenuhnya pada struktur ingatan penggunanya.",
      "stack": [".NET MAUI", "C#", "SQLite", "Memory-Keyed Encryption"],
      "imageUrl": "/assets/null.jpg",
      "liveUrl": "https://github.com/IvandryPage/chronicle-log/releases/tag/v1.2.0",
      "githubUrl": "https://github.com/IvandryPage/chronicle-log"
    },
    {
      "id": "pixelated-journal",
      "title": "Pixelated",
      "subtitle": "Jurnal teknis evolusi C++ dan arsitektur sistem game",
      "concept": "Pixelated adalah dokumentasi kronologis dalam mendalami ekosistem C++. Alih-alih sekadar repositori kode, proyek ini merekam setiap hambatan teknis—mulai dari optimalisasi render loop SFML hingga implementasi arsitektur ECS. Sebuah catatan sistematis yang menjaga setiap kegagalan dan terobosan teknis sebagai fondasi pengembangan sistem di masa depan.",
      "stack": ["C++", "SFML", "Arsitektur ECS"],
      "imageUrl": "/assets/null.jpg",
      "githubUrl": "https://github.com/IvandryPage/pixelated"
    },
    {
      "id": "recrafted",
      "title": "Recrafted",
      "subtitle": "Simulasi perilaku berbasis terminal tentang tekanan akademik",
      "concept": "Eksplorasi interaktif yang jujur mengenai imposter syndrome dan beban psikologis mahasiswa. Dibangun sebagai engine naratif berbasis terminal, Recrafted menggunakan percabangan keputusan yang kompleks untuk mensimulasikan 'logika emosi'. Tanpa distraksi visual, proyek ini memaksa pemain menghadapi dilema moral dan pilihan sulit yang mendefinisikan harga diri.",
      "stack": ["C++", "Terminal-UI", "Logika Percabangan", "Desain Naratif"],
      "imageUrl": "/assets/null.jpg",
      "liveUrl": "#",
      "githubUrl": "https://github.com/IvandryPage/recrafted"
    },
    {
      "id": "raivfy",
      "title": "RAiVFY",
      "subtitle": "Engine manajemen musik low-level dengan struktur data kustom",
      "concept": "Studi mendalam terhadap fundamental ilmu komputer dengan mengimplementasikan Struktur Data secara murni tanpa pustaka tingkat tinggi. Menggunakan Doubly Linked List untuk manajemen playlist, Stack untuk fungsi 'Undo', dan Queue untuk antrean pemutaran. Proyek ini mendemonstrasikan ketelitian logika dalam mengelola alur data pada lingkungan memori terbatas.",
      "stack": ["C++", "Linked List", "Stack & Queue", "Sorting/Searching"],
      "imageUrl": "/assets/null.jpg",
      "githubUrl": "https://github.com/IvandryPage/praktikum-algo-project"
    },
    {
      "|id": "terahub",
      "title": "TeraHub",
      "subtitle": "Prototipe sistem perdagangan aset digital berbasis database",
      "concept": "Eksplorasi fungsional mengenai relasi antara database relasional dan antarmuka pengguna. TeraHub mendemonstrasikan logika fundamental operasi CRUD dan arsitektur marketplace barang digital menggunakan PHP dan MySQL tanpa abstraksi framework modern, guna memahami struktur dasar perdagangan elektronik.",
      "stack": ["PHP", "MySQL", "Web Architecture"],
      "imageUrl": "/assets/null.jpg",
      "githubUrl": "https://github.com/IvandryPage/praktikum-web-project"
    },
    {
      "id": "nadi-bumi",
      "title": "Nadi Bumi",
      "subtitle": "Portal edukasi dan visualisasi data bencana real-time",
      "concept": "Transformasi data seismik mentah menjadi informasi publik yang aksesibel. Nadi Bumi mengintegrasikan API BMKG untuk menyediakan peringatan dini bencana secara instan. Berfokus pada pengolahan data geologi yang kompleks menjadi antarmuka yang informatif, proyek ini berfungsi sebagai pusat edukasi untuk meningkatkan kesiapsiagaan bencana.",
      "stack": ["PHP", "API BMKG", "JSON Parsing", "Web Integration"],
      "imageUrl": "/assets/null.jpg",
      "githubUrl": "https://github.com/IvandryPage/nadi-bumi"
    }
  ]
}